<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Data-wrangling:-join,-combine,-reshape" data-toc-modified-id="Data-wrangling:-join,-combine,-reshape-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Data wrangling: join, combine, reshape</a></span><ul class="toc-item"><li><span><a href="#Hierarchical-indexing" data-toc-modified-id="Hierarchical-indexing-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Hierarchical indexing</a></span><ul class="toc-item"><li><span><a href="#Series-hierarchical-index" data-toc-modified-id="Series-hierarchical-index-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>Series hierarchical index</a></span></li><li><span><a href="#Partial-indexing" data-toc-modified-id="Partial-indexing-1.1.2"><span class="toc-item-num">1.1.2&nbsp;&nbsp;</span>Partial indexing</a></span></li><li><span><a href="#Dataframe-hierarchical-index" data-toc-modified-id="Dataframe-hierarchical-index-1.1.3"><span class="toc-item-num">1.1.3&nbsp;&nbsp;</span>Dataframe hierarchical index</a></span></li><li><span><a href="#Reordering-and-sorting-levels" data-toc-modified-id="Reordering-and-sorting-levels-1.1.4"><span class="toc-item-num">1.1.4&nbsp;&nbsp;</span>Reordering and sorting levels</a></span><ul class="toc-item"><li><span><a href="#swaplevel()" data-toc-modified-id="swaplevel()-1.1.4.1"><span class="toc-item-num">1.1.4.1&nbsp;&nbsp;</span>swaplevel()</a></span></li><li><span><a href="#sort_index" data-toc-modified-id="sort_index-1.1.4.2"><span class="toc-item-num">1.1.4.2&nbsp;&nbsp;</span>sort_index</a></span></li></ul></li><li><span><a href="#Summary-statistics-by-level" data-toc-modified-id="Summary-statistics-by-level-1.1.5"><span class="toc-item-num">1.1.5&nbsp;&nbsp;</span>Summary statistics by level</a></span></li><li><span><a href="#Indexing-with-df-columns" data-toc-modified-id="Indexing-with-df-columns-1.1.6"><span class="toc-item-num">1.1.6&nbsp;&nbsp;</span>Indexing with df columns</a></span><ul class="toc-item"><li><span><a href="#DataFrame.set_index()" data-toc-modified-id="DataFrame.set_index()-1.1.6.1"><span class="toc-item-num">1.1.6.1&nbsp;&nbsp;</span>DataFrame.set_index()</a></span></li><li><span><a href="#DataFrame.reset_index()" data-toc-modified-id="DataFrame.reset_index()-1.1.6.2"><span class="toc-item-num">1.1.6.2&nbsp;&nbsp;</span>DataFrame.reset_index()</a></span></li></ul></li></ul></li><li><span><a href="#Combining-and-merging-datasets" data-toc-modified-id="Combining-and-merging-datasets-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Combining and merging datasets</a></span><ul class="toc-item"><li><span><a href="#Db-style-df-joins" data-toc-modified-id="Db-style-df-joins-1.2.1"><span class="toc-item-num">1.2.1&nbsp;&nbsp;</span>Db-style df joins</a></span></li><li><span><a href="#Concatenating-along-an-axis" data-toc-modified-id="Concatenating-along-an-axis-1.2.2"><span class="toc-item-num">1.2.2&nbsp;&nbsp;</span>Concatenating along an axis</a></span><ul class="toc-item"><li><span><a href="#Concat-in-numpy" data-toc-modified-id="Concat-in-numpy-1.2.2.1"><span class="toc-item-num">1.2.2.1&nbsp;&nbsp;</span>Concat in numpy</a></span></li><li><span><a href="#Concat-in-pandas-Series" data-toc-modified-id="Concat-in-pandas-Series-1.2.2.2"><span class="toc-item-num">1.2.2.2&nbsp;&nbsp;</span>Concat in pandas Series</a></span></li><li><span><a href="#Concat-in-pandas-DataFrame" data-toc-modified-id="Concat-in-pandas-DataFrame-1.2.2.3"><span class="toc-item-num">1.2.2.3&nbsp;&nbsp;</span>Concat in pandas DataFrame</a></span></li></ul></li><li><span><a href="#Combining-data-with-overlap" data-toc-modified-id="Combining-data-with-overlap-1.2.3"><span class="toc-item-num">1.2.3&nbsp;&nbsp;</span>Combining data with overlap</a></span></li></ul></li><li><span><a href="#Reshaping-and-pivoting" data-toc-modified-id="Reshaping-and-pivoting-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Reshaping and pivoting</a></span><ul class="toc-item"><li><span><a href="#Reshaping-with-hierarchical-indexing" data-toc-modified-id="Reshaping-with-hierarchical-indexing-1.3.1"><span class="toc-item-num">1.3.1&nbsp;&nbsp;</span>Reshaping with hierarchical indexing</a></span></li><li><span><a href="#Pivoting-&quot;long&quot;-to-&quot;wide&quot;-format" data-toc-modified-id="Pivoting-&quot;long&quot;-to-&quot;wide&quot;-format-1.3.2"><span class="toc-item-num">1.3.2&nbsp;&nbsp;</span>Pivoting "long" to "wide" format</a></span></li><li><span><a href="#Pivoting-&quot;wide&quot;-to-&quot;long&quot;-format" data-toc-modified-id="Pivoting-&quot;wide&quot;-to-&quot;long&quot;-format-1.3.3"><span class="toc-item-num">1.3.3&nbsp;&nbsp;</span>Pivoting "wide" to "long" format</a></span></li></ul></li></ul></li></ul></div>

In [1]:
import pandas as pd
#import pandas_datareader.data as web
print(pd.__version__)

import numpy as np
from numpy import nan as NA

import pprint

0.25.0

# Data wrangling: join, combine, reshape

- Data can be spread across files or databases, or in a way that is difficult to analyze

## Hierarchical indexing

- Two or more index levels on an axis
  - Allows to work with high dimensional data using a lower dimensional form
  
- Used in:
    - group based operations
    - pivot tables
    - reshaping
    
- INV: A hierarchical index comes when a list of lists is used (instead of a simple list)
- INV: Indexing in a hierarchical index is like indexing in a np array

### Series hierarchical index

In [2]:
# Create a hierarchical index.
np.random.seed(10)

data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])

data

a  1    1.331587
   2    0.715279
   3   -1.545400
b  1   -0.008384
   3    0.621336
c  1   -0.720086
   2    0.265512
d  2    0.108549
   3    0.004291
dtype: float64

In [3]:
# There are
# - "levels", i.e., the values that are used as Cartesian product.
# - the subset of the indices (in the "labels" sets).
# E.g.,
#   (0, 0) -> (a, 1)
#   (0, 1) -> (a, 2)
# ...

data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

### Partial indexing

In [4]:
# Partial indexing.

# Extract the values for the first level.
data['b']

1   -0.008384
3    0.621336
dtype: float64

In [5]:
# Range of one level of an index.
data['b':'c']

b  1   -0.008384
   3    0.621336
c  1   -0.720086
   2    0.265512
dtype: float64

In [6]:
# Select some indices with .loc[list].
data.loc[['b', 'd']]

b  1   -0.008384
   3    0.621336
d  2    0.108549
   3    0.004291
dtype: float64

In [7]:
# Select all the first level and part of the second.
# Indexing works like a numpy array.
data.loc[:, 2]

a    0.715279
c    0.265512
d    0.108549
dtype: float64

In [8]:
# .unstack() moves one level of indexing into the columns.
data2 = data.unstack()
data2

          1         2         3
a  1.331587  0.715279 -1.545400
b -0.008384       NaN  0.621336
c -0.720086  0.265512       NaN
d       NaN  0.108549  0.004291

In [9]:
# .stack() moves the column index into a hierarchical index.
data2.stack()

a  1    1.331587
   2    0.715279
   3   -1.545400
b  1   -0.008384
   3    0.621336
c  1   -0.720086
   2    0.265512
d  2    0.108549
   3    0.004291
dtype: float64

### Dataframe hierarchical index

- In a df both columns and rows can have a hierarchical index
    - Note that indices in pandas have "values" and "names"

In [10]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)))
frame

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [11]:
frame = pd.DataFrame(
    np.arange(12).reshape((4, 3)),
    index=['a a b b'.split(),
           list(map(int, '1 2 1 2'.split()))],
    columns=['Ohio Ohio Colorado'.split(),
             'Green Red Green'.split()])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [12]:
frame.index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [13]:
frame.columns

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           )

In [14]:
# The levels have no name.
print(frame.index.names)
print(frame.columns.names)

[None, None]
[None, None]

In [15]:
# Assign names to hierarchical levels.
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']

frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [16]:
# A multiindex can be created by itself and used.

In [17]:
print(frame.columns)

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

In [18]:
pd.MultiIndex.from_arrays(
    ['Ohio Ohio Colorado'.split(), 'Green Red Green'.split()],
    names=['state', 'color'])

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

### Reordering and sorting levels

#### swaplevel()

In [19]:
# Swap (or reorder) the order of the levels on an axis.
display(frame)
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

#### sort_index

In [20]:
# Sort the values in one specific level.
display(frame)
frame2 = frame.sort_index(
    # level=1 is key2
    #level="key2")
    level=1)

frame2

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [21]:
frame2.sort_index(
    # level=0 is key1
    level=0)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

### Summary statistics by level

In [22]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [23]:
#frame.sum(level='key2')
frame.sum(level=1)

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [24]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Indexing with df columns

- One can create an index from a column

#### DataFrame.set_index()

In [25]:
# Build from dictionary: each (key, value) becomes a column.
# A new index is added.
frame = pd.DataFrame({
    'a': list(range(7)),
    'b': list(range(7, 0, -1)),
    'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
    'd': [0, 1, 2, 0, 1, 2, 3]
})

frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [26]:
# Use two columns as index.
frame2 = frame.set_index(['c', 'd'])

frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

#### DataFrame.reset_index()

In [27]:
# Move index to columns and reindex with unique integer
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [28]:
# Two reset index creates two indices.
frame2.reset_index().reset_index()

   index    c  d  a  b
0      0  one  0  0  7
1      1  one  1  1  6
2      2  one  2  2  5
3      3  two  0  3  4
4      4  two  1  4  3
5      5  two  2  5  2
6      6  two  3  6  1

## Combining and merging datasets

### Db-style df joins

In [29]:
df1 = pd.DataFrame({
    'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
    'data1': list(range(7))
})
df2 = pd.DataFrame({
    'key': ['a', 'b', 'd'],
    'data2': list(range(3))})

print("df1=")
display(df1)
print("\ndf2=")
display(df2)

df1=

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

df2=

  key  data2
0   a      0
1   b      1
2   d      2

In [30]:
# We want to merge on column "key"
# This is a many-to-one join
# - the data in df1['key'] has multiple rows with 'a', and 'b'
# - df2['key'] has fewer
# so there will be a partial Cartesian product.

# Default values
# - Without specifying the columns to join, the common columns are used
# - inner join

# pd.merge(df1, df2, on='key')
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [31]:
# One can specify explicitly different column names
# E.g.,
#   pd.merge(df3, df4, left_on='lkey', right_on='rkey')

# - Indexes are discarded
# - Common columns not used for joined are renamed _x, _y

In [32]:
# To merge on index
#   pd.merge(df1, df2, left_on='key', right_index=True)

# Merge on index with multi-index
#   pd.merge(df1, df2, left_on=['key1', 'key2'], right_index=True)

# Merge on both indices
#   pd.merge(df1, df2, how='outer', left_index=True, right_index=True)

### Concatenating along an axis

- Aka stacking

#### Concat in numpy

In [33]:
arr = np.arange(12)
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11])

In [34]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [35]:
# Concatenate horizontally.
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [36]:
# Concatenate vertically.
np.concatenate([arr, arr], axis=0)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

#### Concat in pandas Series

- Since pandas objects (e.g., Series and DataFrame) have labeled axis 
    - If indexes are different, should do union or intersection of labels?
    - Should we preserve the labels or discard it after concatenation?

In [37]:
s1 = pd.Series([0, 1], index='a b'.split())
print("s1=\n%s" % s1)

s2 = pd.Series([2, 3, 4], index='c d e'.split())
print("\ns2=\n%s" % s2)

s3 = pd.Series([5, 6], index='f g'.split())
print("\ns3=\n%s"% s3)

s1=
a    0
b    1
dtype: int64

s2=
c    2
d    3
e    4
dtype: int64

s3=
f    5
g    6
dtype: int64

In [38]:
# Concat series along axis=0 producing another Series with index and values glued together.
pd.concat([s1, s2, s3], axis=0)

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [39]:
# Concat series along axis=1, does a union of the indices and then merges into a DataFrame
# (sorted outer join).
pd.concat([s1, s2, s3], axis=1, sort=True)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [40]:
# concat() can also do a inner join.
pd.concat([s1, s2, s3], axis=1, join="inner")

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [41]:
# If you want to identify where the data came from, you can use
# a hierarchical axis.
result = pd.concat([s1, s1, s3], keys="one two three".split())
print(result.index)
result

MultiIndex([(  'one', 'a'),
            (  'one', 'b'),
            (  'two', 'a'),
            (  'two', 'b'),
            ('three', 'f'),
            ('three', 'g')],
           )

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [42]:
# Unstack moves a level of hierarchical indexing into columns.
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

#### Concat in pandas DataFrame

In [43]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2),
                   index=['a', 'b', 'c'],
                   columns=['one', 'two'])

print("df1=")
display(df1)

df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2),
                   index=['a', 'c'],
                   columns=['three', 'four'])

print("\ndf2=")
display(df2)

df1=

   one  two
a    0    1
b    2    3
c    4    5

df2=

   three  four
a      5     6
c      7     8

In [44]:
# Merge using hierarchical columns to track where the data is coming from.
# axis=1 means (columns)
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

/Users/saggese/.conda/envs/study/lib/python3.7/site-packages/ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [45]:
# "ignore_index=True" is used to ignore the indices and create a new
# numeric index.
pd.concat([df1, df2], axis=0, sort=True)

   four  one  three  two
a   NaN  0.0    NaN  1.0
b   NaN  2.0    NaN  3.0
c   NaN  4.0    NaN  5.0
a   6.0  NaN    5.0  NaN
c   8.0  NaN    7.0  NaN

In [46]:
pd.concat([df1, df2], axis=0, ignore_index=True, sort=True)

   four  one  three  two
0   NaN  0.0    NaN  1.0
1   NaN  2.0    NaN  3.0
2   NaN  4.0    NaN  5.0
3   6.0  NaN    5.0  NaN
4   8.0  NaN    7.0  NaN

In [47]:
# Check if there are duplicated indices.
#pd.concat([df1, df2], axis=0, verify_integrity=True)

### Combining data with overlap

In [48]:
# np.where() performs a vectorized if-then-else operation.

a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
             index="f e d c b a".split())
print(a)

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [49]:
b = pd.Series(np.arange(len(a), dtype=np.float64),
              index="f e d c b a".split())
b[-1] = np.nan

display(b)

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [50]:
# We can combine the two series by using the values from a and
# using values from b to fill the nan.

# Compute the null values 
np.where(pd.isnull(a), b, a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [51]:
a.combine_first(b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    NaN
dtype: float64

## Reshaping and pivoting

### Reshaping with hierarchical indexing

- `stack`: rotates (or pivots) from the columns to the rows
- `unstack`: pivots from the rows into the columns

In [52]:
data = pd.DataFrame(
    np.arange(6).reshape((2, 3)),
    index=pd.Index(['Ohio', 'Colorado'], name='state'),
    columns=pd.Index(['one', 'two', 'three'], name='number'))

data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [53]:
# Note that it produces a Series since it has a single column.
result = data.stack()

print(type(result))
print(type(result.index))
result

<class 'pandas.core.series.Series'>
<class 'pandas.core.indexes.multi.MultiIndex'>

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [54]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [55]:
# One can unstack a different level than the innermost.
# Level 0 is the outermost.
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [56]:
# unstack() can produce nan if there are missing values.
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])
# Concat vertically the series.
data2 = pd.concat([s1, s2], keys=['one', 'two'])

print("data2=")
print(type(data2))
display(data2)

print("data2.unstack=")
data2.unstack()

data2=
<class 'pandas.core.series.Series'>

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

data2.unstack=

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [57]:
print("data2=")
# gives the original object.
data2.unstack().stack()

data2=

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

### Pivoting "long" to "wide" format

In [58]:
# git clone https://github.com/wesm/pydata-book
data = pd.read_csv("/Users/saggese/src/pydata-book/examples/macrodata.csv")

display(data.head())
display(data.tail())

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
198,2008.0,3.0,13324.600,9267.7,1990.693,991.551,9838.3,216.889,1474.7,1.17,6.0,305.270,-3.16,4.33
199,2008.0,4.0,13141.920,9195.3,1857.661,1007.273,9920.4,212.174,1576.5,0.12,6.9,305.952,-8.79,8.91
200,2009.0,1.0,12925.410,9209.2,1558.494,996.287,9926.4,212.671,1592.8,0.22,8.1,306.547,0.94,-0.71
201,2009.0,2.0,12901.504,9189.0,1456.678,1023.528,10077.5,214.469,1653.6,0.18,9.2,307.226,3.37,-3.19
202,2009.0,3.0,12990.341,9256.0,1486.398,1044.088,10040.6,216.385,1673.9,0.12,9.6,308.013,3.56,-3.44

In [59]:
# Combine year and quarter to create a kind of time interval type.
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter, name='date')
print(periods)

data2 = data.copy()
data2.index = periods.to_timestamp('D', 'end')

# The data is in "wide" format.
data2.head()

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', name='date', length=203, freq='Q-DEC')

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
date,,,,,,,,,,,,,,
1959-03-31 23:59:59.999999999,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1959-06-30 23:59:59.999999999,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
1959-09-30 23:59:59.999999999,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
1959-12-31 23:59:59.999999999,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
1960-03-31 23:59:59.999999999,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [60]:
# We need to assign a name to the column otherwise when we "melt"
# the column is not going to have a name.
columns = pd.Index(['realgdp', 'infl', 'unemp'], name='item')
# Use reindex to extract columns.
data2 = data2.reindex(columns=columns)
print("columns=", columns)

data2.head()

columns= Index(['realgdp', 'infl', 'unemp'], dtype='object', name='item')

item                            realgdp  infl  unemp
date
1959-03-31 23:59:59.999999999  2710.349  0.00    5.8
1959-06-30 23:59:59.999999999  2778.801  2.34    5.1
1959-09-30 23:59:59.999999999  2775.488  2.74    5.3
1959-12-31 23:59:59.999999999  2785.204  0.27    5.6
1960-03-31 23:59:59.999999999  2847.699  2.31    5.2

In [61]:
# Put data in "long" format by moving the three columns into one.
ldata = data2.stack().reset_index()
# Rename column to value.
ldata = ldata.rename(columns={0: 'value'})
ldata.head()

                           date     item     value
0 1959-03-31 23:59:59.999999999  realgdp  2710.349
1 1959-03-31 23:59:59.999999999     infl     0.000
2 1959-03-31 23:59:59.999999999    unemp     5.800
3 1959-06-30 23:59:59.999999999  realgdp  2778.801
4 1959-06-30 23:59:59.999999999     infl     2.340

In [62]:
# pivot() allows to transform from long format to wide format.
pivoted = ldata.pivot('date', 'item', 'value')
pivoted.head()

item                           infl   realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00  2710.349    5.8
1959-06-30 23:59:59.999999999  2.34  2778.801    5.1
1959-09-30 23:59:59.999999999  2.74  2775.488    5.3
1959-12-31 23:59:59.999999999  0.27  2785.204    5.6
1960-03-31 23:59:59.999999999  2.31  2847.699    5.2

In [63]:
# Add another row: now we have an item and 2 values for each.
ldata2 = ldata.copy()
ldata2['value2'] = np.random.randn(len(ldata)) 

display(ldata2.head())

                           date     item     value    value2
0 1959-03-31 23:59:59.999999999  realgdp  2710.349 -0.174600
1 1959-03-31 23:59:59.999999999     infl     0.000  0.433026
2 1959-03-31 23:59:59.999999999    unemp     5.800  1.203037
3 1959-06-30 23:59:59.999999999  realgdp  2778.801 -0.965066
4 1959-06-30 23:59:59.999999999     infl     2.340  1.028274

In [64]:
# Pivoting when there are multiple values creates a hierarchical
# data frame.
pivoted = ldata2.pivot('date', 'item')

pivoted.head()

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8  0.433026 -0.174600
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1  1.028274 -0.965066
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3 -1.136602  0.445138
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6 -1.079805  1.484537
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2  0.266070 -1.743372


item                              unemp
date
1959-03-31 23:59:59.999999999  1.203037
1959-06-30 23:59:59.999999999  0.228630
1959-09-30 23:59:59.999999999  0.135137
1959-12-31 23:59:59.999999999 -1.977728
1960-03-31 23:59:59.999999999  2.384967

### Pivoting "wide" to "long" format

In [65]:
# The inverse operation to "pivot" is "melt".

df = pd.DataFrame({
    'key': ['foo', 'bar', 'baz'],
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
})

df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [66]:
# We need to decide which column is:
# - the variable
# - the value

melted = pd.melt(df, ["key"])

melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9